<?php

return [
    // 沿線
    'station_line' => [
        '11301' => 'JR東海道本線(東京～熱海)',
        '11302' => 'JR山手線',
        '11303' => 'JR南武線',
        '11305' => 'JR武蔵野線',
        '11306' => 'JR横浜線',
        '11308' => 'JR横須賀線',
        '11311' => 'JR中央本線(東京～塩尻)',
        '11312' => 'JR中央線(快速)',
        '11313' => 'JR中央・総武線',
        '11314' => 'JR総武本線',
        '11315' => 'JR青梅線',
        '11316' => 'JR五日市線',
        '11317' => 'JR八高線(八王子～高麗川)',
        '11319' => '宇都宮線',
        '11320' => 'JR常磐線(上野～取手)',
        '11321' => 'JR埼京線',
        '11323' => 'JR高崎線',
        '11326' => 'JR京葉線',
        '11328' => 'JR成田エクスプレス',
        '11332' => 'JR京浜東北線',
        '11333' => 'JR湘南新宿ライン',
        '11343' => '上野東京ライン',
        '21001' => '東武東上線',
        '21002' => '東武伊勢崎線',
        '21005' => '東武亀戸線',
        '21006' => '東武大師線',
        '22001' => '西武池袋線',
        '22003' => '西武有楽町線',
        '22004' => '西武豊島線',
        '22006' => 'レオライナー',
        '22007' => '西武新宿線',
        '22008' => '西武拝島線',
        '22009' => '西武西武園線',
        '22010' => '西武国分寺線',
        '22011' => '西武多摩湖線',
        '22012' => '西武多摩川線',
        '23001' => '京成本線',
        '23002' => '京成押上線',
        '23003' => '京成金町線',
        '23006' => '成田スカイアクセス',
        '24001' => '京王線',
        '24002' => '京王相模原線',
        '24003' => '京王高尾線',
        '24004' => '京王競馬場線',
        '24005' => '京王動物園線',
        '24006' => '京王井の頭線',
        '24007' => '京王新線',
        '25001' => '小田急線',
        '25003' => '小田急多摩線',
        '26001' => '東急東横線',
        '26002' => '東急目黒線',
        '26003' => '東急田園都市線',
        '26004' => '東急大井町線',
        '26005' => '東急池上線',
        '26006' => '東急多摩川線',
        '26007' => '東急世田谷線',
        '27001' => '京急本線',
        '27002' => '京急空港線',
        '28001' => '東京メトロ銀座線',
        '28002' => '東京メトロ丸ノ内線',
        '28003' => '東京メトロ日比谷線',
        '28004' => '東京メトロ東西線',
        '28005' => '東京メトロ千代田線',
        '28006' => '東京メトロ有楽町線',
        '28008' => '東京メトロ半蔵門線',
        '28009' => '東京メトロ南北線',
        '28010' => '東京メトロ副都心線',
        '99301' => '都営大江戸線',
        '99302' => '都営浅草線',
        '99303' => '都営三田線',
        '99304' => '都営新宿線',
        '99305' => '都電荒川線',
        '99307' => '埼玉高速鉄道線',
        '99309' => 'つくばエクスプレス',
        '99311' => 'ゆりかもめ',
        '99334' => '多摩モノレール',
        '99336' => '東京モノレール',
        '99337' => 'りんかい線',
        '99340' => '北総鉄道北総線',
        '99342' => '日暮里・舎人ライナー',
    ],
    // エリアL
    'area_l' => [
        "AREAL2101" => "銀座・有楽町・築地",
        "AREAL2107" => "新橋・浜松町・田町",
        "AREAL2133" => "赤坂・六本木・麻布",
        "AREAL2184" => "飯田橋・四ツ谷・神楽坂",
        "AREAL2115" => "新宿・代々木",
        "AREAL2116" => "大久保・高田馬場",
        "AREAL2125" => "渋谷・原宿・青山",
        "AREAL2156" => "池袋・巣鴨・駒込",
        "AREAL2141" => "東京駅・丸の内・日本橋",
        "AREAL2198" => "上野・浅草・日暮里",
        "AREAL2142" => "神田・秋葉原・水道橋",
        "AREAL2169" => "品川・五反田・大崎",
        "AREAL2170" => "お台場・豊洲・湾岸",
        "AREAL2178" => "恵比寿・中目黒・目黒",
        "AREAL2164" => "自由が丘・三軒茶屋・二子玉川",
        "AREAL2207" => "下北沢・明大前・成城学園前",
        "AREAL2217" => "中野・吉祥寺・三鷹",
        "AREAL2222" => "練馬・江古田・田無",
        "AREAL2228" => "錦糸町・押上・新小岩",
        "AREAL2146" => "人形町・門前仲町・葛西",
        "AREAL2241" => "北千住・綾瀬・亀有",
        "AREAL2250" => "板橋・成増・赤羽",
        "AREAL2254" => "大井町・大森・蒲田",
        "AREAL2273" => "府中・調布",
        "AREAL2923" => "町田・多摩",
        "AREAL2278" => "小金井・国分寺・国立",
        "AREAL2286" => "立川・八王子・青梅",
        "AREAL2295" => "伊豆諸島・小笠原諸島",
    ],
    // ぐるなびAPI
    'gnavi' => [
        'category' => [
            'yakiniku' => [
                [
                    "category_s_code" => "RSFST05001",
                    "category_s_name" => "焼肉",
                    "category_l_code" => "RSFST05000"
                ],
                [
                    "category_s_code" => "RSFST05004",
                    "category_s_name" => "サムギョプサル",
                    "category_l_code" => "RSFST05000"
                ],
                [
                    "category_s_code" => "RSFST05002",
                    "category_s_name" => "ホルモン",
                    "category_l_code" => "RSFST05000"
                ],
                [
                    "category_s_code" => "RSFST05003",
                    "category_s_name" => "ジンギスカン",
                    "category_l_code" => "RSFST05000"
                ],
            ],
            'yakitori' => [
                [
                    "category_s_code" => "RSFST06003",
                    "category_s_name" => "焼き鳥",
                    "category_l_code" => "RSFST06000"
                ],
                [
                    "category_s_code" => "RSFST06004",
                    "category_s_name" => "鶏料理(鳥料理)",
                    "category_l_code" => "RSFST06000"
                ],
                [
                    "category_s_code" => "RSFST06012",
                    "category_s_name" => "串焼き",
                    "category_l_code" => "RSFST06000"
                ],
                [
                    "category_s_code" => "RSFST06018",
                    "category_s_name" => "鴨料理",
                    "category_l_code" => "RSFST06000"
                ]
            ],
            'steak' => [
                [
                    "category_s_code" => "RSFST06009",
                    "category_s_name" => "ステーキ",
                    "category_l_code" => "RSFST06000"
                ],
            ],
            'hamburg' => [
                [
                    "category_s_code" => "RSFST06010",
                    "category_s_name" => "ハンバーグ",
                    "category_l_code" => "RSFST06000"
                ],
            ],
            'hamburger' => [
                [
                    "category_s_code" => "RSFST06011",
                    "category_s_name" => "ハンバーガー",
                    "category_l_code" => "RSFST18000"
                ],
            ],
            'bar' => [
                [],
            ],
            'other' => [
                [
                    "category_s_code" => "RSFST06001",
                    "category_s_name" => "牛タン",
                    "category_l_code" => "RSFST06000"
                ],
                [
                    "category_s_code" => "RSFST06006",
                    "category_s_name" => "鉄板焼き",
                    "category_l_code" => "RSFST06000"
                ],
                [
                    "category_s_code" => "RSFST06013",
                    "category_s_name" => "豚肉料理",
                    "category_l_code" => "RSFST06000"
                ],
                [
                    "category_s_code" => "RSFST06014",
                    "category_s_name" => "馬肉料理",
                    "category_l_code" => "RSFST06000"
                ],
            ],
        ],
    ],
];